zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27WLSOM1.atdf
      <value-group caption="RGB Mode Input Selection" name="LCDC_OVR2CFG1__RGBMODE">
        <value caption="12 bpp RGB 444" name="_12BPP_RGB_444" value="0x0"/>
        <value caption="16 bpp ARGB 4444" name="_16BPP_ARGB_4444" value="0x1"/>
        <value caption="16 bpp RGBA 4444" name="_16BPP_RGBA_4444" value="0x2"/>
        <value caption="16 bpp RGB 565" name="_16BPP_RGB_565" value="0x3"/>
        <value caption="16 bpp TRGB 1555" name="_16BPP_TRGB_1555" value="0x4"/>
        <value caption="18 bpp RGB 666" name="_18BPP_RGB_666" value="0x5"/>
        <value caption="18 bpp RGB 666 PACKED" name="_18BPP_RGB_666PACKED" value="0x6"/>
        <value caption="19 bpp TRGB 1666" name="_19BPP_TRGB_1666" value="0x7"/>
        <value caption="19 bpp TRGB 1666 PACKED" name="_19BPP_TRGB_PACKED" value="0x8"/>
        <value caption="24 bpp RGB 888" name="_24BPP_RGB_888" value="0x9"/>
        <value caption="24 bpp RGB 888 PACKED" name="_24BPP_RGB_888_PACKED" value="0xA"/>
        <value caption="25 bpp TRGB 1888" name="_25BPP_TRGB_1888" value="0xB"/>
        <value caption="32 bpp ARGB 8888" name="_32BPP_ARGB_8888" value="0xC"/>
        <value caption="32 bpp RGBA 8888" name="_32BPP_RGBA_8888" value="0xD"/>
      </value-group>
      <value-group caption="Color Lookup Table Mode Input Selection" name="LCDC_OVR2CFG1__CLUTMODE">
        <value caption="Color Lookup Table mode set to 1 bit per pixel" name="CLUT_1BPP" value="0x0"/>
        <value caption="Color Lookup Table mode set to 2 bits per pixel" name="CLUT_2BPP" value="0x1"/>
        <value caption="Color Lookup Table mode set to 4 bits per pixel" name="CLUT_4BPP" value="0x2"/>
        <value caption="Color Lookup Table mode set to 8 bits per pixel" name="CLUT_8BPP" value="0x3"/>
      </value-group>
      <value-group caption="AHB Burst Length" name="LCDC_HEOCFG0__BLEN">
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_SINGLE" value="0x0"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_INCR4" value="0x1"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_INCR8" value="0x2"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_BLEN_INCR16" value="0x3"/>
      </value-group>
      <value-group caption="AHB Burst Length for U-V Channel" name="LCDC_HEOCFG0__BLENUV">
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store one data. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_SINGLE" value="0x0"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 4 data. An AHB INCR4 Burst is used. SINGLE, INCR and INCR4 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR4" value="0x1"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 8 data. An AHB INCR8 Burst is used. SINGLE, INCR, INCR4 and INCR8 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR8" value="0x2"/>
        <value caption="AHB Access is started as soon as there is enough space in the FIFO to store a total amount of 16 data. An AHB INCR16 Burst is used. SINGLE, INCR, INCR4, INCR8 and INCR16 bursts are used. INCR is used for a burst of 2 and 3 beats." name="AHB_INCR16" value="0x3"/>
      </value-group>
      <value-group caption="RGB Mode Input Selection" name="LCDC_HEOCFG1__RGBMODE">
        <value caption="12 bpp RGB 444" name="_12BPP_RGB_444" value="0x0"/>
        <value caption="16 bpp ARGB 4444" name="_16BPP_ARGB_4444" value="0x1"/>
        <value caption="16 bpp RGBA 4444" name="_16BPP_RGBA_4444" value="0x2"/>
        <value caption="16 bpp RGB 565" name="_16BPP_RGB_565" value="0x3"/>
        <value caption="16 bpp TRGB 1555" name="_16BPP_TRGB_1555" value="0x4"/>
        <value caption="18 bpp RGB 666" name="_18BPP_RGB_666" value="0x5"/>
        <value caption="18 bpp RGB 666 PACKED" name="_18BPP_RGB_666PACKED" value="0x6"/>
        <value caption="19 bpp TRGB 1666" name="_19BPP_TRGB_1666" value="0x7"/>
        <value caption="19 bpp TRGB 1666 PACKED" name="_19BPP_TRGB_PACKED" value="0x8"/>
        <value caption="24 bpp RGB 888" name="_24BPP_RGB_888" value="0x9"/>
        <value caption="24 bpp RGB 888 PACKED" name="_24BPP_RGB_888_PACKED" value="0xA"/>
        <value caption="25 bpp TRGB 1888" name="_25BPP_TRGB_1888" value="0xB"/>
        <value caption="32 bpp ARGB 8888" name="_32BPP_ARGB_8888" value="0xC"/>
        <value caption="32 bpp RGBA 8888" name="_32BPP_RGBA_8888" value="0xD"/>
      </value-group>
      <value-group caption="Color Lookup Table Mode Input Selection" name="LCDC_HEOCFG1__CLUTMODE">
        <value caption="Color Lookup Table mode set to 1 bit per pixel" name="CLUT_1BPP" value="0x0"/>
        <value caption="Color Lookup Table mode set to 2 bits per pixel" name="CLUT_2BPP" value="0x1"/>
        <value caption="Color Lookup Table mode set to 4 bits per pixel" name="CLUT_4BPP" value="0x2"/>
        <value caption="Color Lookup Table mode set to 8 bits per pixel" name="CLUT_8BPP" value="0x3"/>
      </value-group>
      <value-group caption="Post Processing Output Format Selection" name="LCDC_PPCFG1__PPMODE">
        <value caption="RGB 16 bpp" name="PPMODE_RGB_16BPP" value="0x0"/>
        <value caption="RGB 24 bpp PACKED" name="PPMODE_RGB_24BPP_PACKED" value="0x1"/>
        <value caption="RGB 24 bpp UNPACKED" name="PPMODE_RGB_24BPP_UNPACKED" value="0x2"/>
        <value caption="YCbCr 422 16 bpp (Mode 0)" name="PPMODE_YCBCR_422_MODE0" value="0x3"/>
        <value caption="YCbCr 422 16 bpp (Mode 1)" name="PPMODE_YCBCR_422_MODE1" value="0x4"/>
        <value caption="YCbCr 422 16 bpp (Mode 2)" name="PPMODE_YCBCR_422_MODE2" value="0x5"/>
        <value caption="YCbCr 422 16 bpp (Mode 3)" name="PPMODE_YCBCR_422_MODE3" value="0x6"/>
      </value-group>
    </module>
    <module caption="AHB Bus Matrix" id="44025" name="MATRIX" version="I">
      <register-group name="MATRIX_PR" size="8">
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS" offset="0x0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 0" name="MATRIX_PRBS" offset="0x4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
        </register>
      </register-group>
      <register-group name="MATRIX">
        <register caption="Master Configuration Register" count="12" name="MATRIX_MCFG" offset="0x0000" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
        <register caption="Slave Configuration Register" count="15" name="MATRIX_SCFG" offset="0x0040" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register-group count="15" name="MATRIX_PR" name-in-module="MATRIX_PR" offset="0x0080" size="8"/>
        <register caption="Master Error Interrupt Enable Register" name="MATRIX_MEIER" offset="0x0150" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
        </register>
        <register caption="Master Error Interrupt Disable Register" name="MATRIX_MEIDR" offset="0x0154" rw="W" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
        </register>
        <register caption="Master Error Interrupt Mask Register" name="MATRIX_MEIMR" offset="0x0158" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
        </register>
