zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27WLSOM1.atdf
        <register caption="Refresh Timer Register" name="MPDDRC_RTR" offset="0x04" rw="RW" size="4">
          <bitfield caption="MPDDRC Refresh Timer Count" mask="0x00000FFF" name="COUNT"/>
          <bitfield caption="Adjust Refresh Rate" mask="0x00010000" name="ADJ_REF"/>
          <bitfield caption="Refresh Per Bank" mask="0x00020000" name="REF_PB"/>
          <bitfield caption="Content of MR4 Register (read-only)" mask="0x00700000" name="MR4_VALUE"/>
        </register>
        <register caption="Configuration Register" name="MPDDRC_CR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Number of Column Bits" mask="0x00000003" name="NC" values="MPDDRC_CR__NC"/>
          <bitfield caption="Number of Row Bits" mask="0x0000000C" name="NR" values="MPDDRC_CR__NR"/>
          <bitfield caption="CAS Latency" mask="0x00000070" name="CAS" values="MPDDRC_CR__CAS"/>
          <bitfield caption="Reset DLL" mask="0x00000080" name="DLL" values="MPDDRC_CR__DLL"/>
          <bitfield caption="Output Driver Impedance Control (Drive Strength)" mask="0x00000100" name="DIC_DS" values="MPDDRC_CR__DIC_DS"/>
          <bitfield caption="DISABLE DLL" mask="0x00000200" name="DIS_DLL"/>
          <bitfield caption="ZQ Calibration" mask="0x00000C00" name="ZQ" values="MPDDRC_CR__ZQ"/>
          <bitfield caption="Off-chip Driver" mask="0x00007000" name="OCD" values="MPDDRC_CR__OCD"/>
          <bitfield caption="Mask Data is Shared" mask="0x00010000" name="DQMS" values="MPDDRC_CR__DQMS"/>
          <bitfield caption="Enable Read Measure" mask="0x00020000" name="ENRDM" values="MPDDRC_CR__ENRDM"/>
          <bitfield caption="Low-cost Low-power DDR1" mask="0x00080000" name="LC_LPDDR1" values="MPDDRC_CR__LC_LPDDR1"/>
          <bitfield caption="Number of Banks" mask="0x00100000" name="NB" values="MPDDRC_CR__NB"/>
          <bitfield caption="Not DQS" mask="0x00200000" name="NDQS" values="MPDDRC_CR__NDQS"/>
          <bitfield caption="Type of Decoding" mask="0x00400000" name="DECOD" values="MPDDRC_CR__DECOD"/>
          <bitfield caption="Support Unaligned Access" mask="0x00800000" name="UNAL" values="MPDDRC_CR__UNAL"/>
        </register>
        <register caption="Timing Parameter 0 Register" name="MPDDRC_TPR0" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Active to Precharge Delay" mask="0x0000000F" name="TRAS"/>
          <bitfield caption="Row to Column Delay" mask="0x000000F0" name="TRCD"/>
          <bitfield caption="Write Recovery Delay" mask="0x00000F00" name="TWR"/>
          <bitfield caption="Row Cycle Delay" mask="0x0000F000" name="TRC"/>
          <bitfield caption="Row Precharge Delay" mask="0x000F0000" name="TRP"/>
          <bitfield caption="Active BankA to Active BankB" mask="0x00F00000" name="TRRD"/>
          <bitfield caption="Internal Write to Read Delay" mask="0x07000000" name="TWTR"/>
          <bitfield caption="Load Mode Register Command to Activate or Refresh Command" mask="0xF0000000" name="TMRD"/>
        </register>
        <register caption="Timing Parameter 1 Register" name="MPDDRC_TPR1" offset="0x10" rw="RW" size="4">
          <bitfield caption="Row Cycle Delay" mask="0x0000007F" name="TRFC"/>
          <bitfield caption="Exit Self-refresh Delay to Non-Read Command" mask="0x0000FF00" name="TXSNR"/>
          <bitfield caption="Exit Self-refresh Delay to Read Command" mask="0x00FF0000" name="TXSRD"/>
          <bitfield caption="Exit Powerdown Delay to First Command" mask="0x0F000000" name="TXP"/>
        </register>
        <register caption="Timing Parameter 2 Register" name="MPDDRC_TPR2" offset="0x14" rw="RW" size="4">
          <bitfield caption="Exit Active Power Down Delay to Read Command in Mode &quot;Fast Exit&quot;" mask="0x0000000F" name="TXARD"/>
          <bitfield caption="Exit Active Power Down Delay to Read Command in Mode &quot;Slow Exit&quot;" mask="0x000000F0" name="TXARDS"/>
          <bitfield caption="Row Precharge All Delay" mask="0x00000F00" name="TRPA"/>
          <bitfield caption="Read to Precharge" mask="0x00007000" name="TRTP"/>
          <bitfield caption="Four Active Windows" mask="0x000F0000" name="TFAW"/>
        </register>
        <register caption="Low-Power Register" name="MPDDRC_LPR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Low-power Command Bit" mask="0x00000003" name="LPCB" values="MPDDRC_LPR__LPCB"/>
          <bitfield caption="Clock Frozen Command Bit" mask="0x00000004" name="CLK_FR" values="MPDDRC_LPR__CLK_FR"/>
          <bitfield caption="LPDDR2 - LPDDR3 Power Off Bit" mask="0x00000008" name="LPDDR2_LPDDR3_PWOFF" values="MPDDRC_LPR__LPDDR2_LPDDR3_PWOFF"/>
          <bitfield caption="Partial Array Self-refresh" mask="0x00000070" name="PASR"/>
          <bitfield caption="Drive Strength" mask="0x00000700" name="DS" values="MPDDRC_LPR__DS"/>
          <bitfield caption="Time Between Last Transfer and Low-Power Mode" mask="0x00003000" name="TIMEOUT" values="MPDDRC_LPR__TIMEOUT"/>
          <bitfield caption="Active Power Down Exit Time" mask="0x00010000" name="APDE" values="MPDDRC_LPR__APDE"/>
          <bitfield caption="Update Load Mode Register and Extended Mode Register" mask="0x00300000" name="UPD_MR" values="MPDDRC_LPR__UPD_MR"/>
          <bitfield caption="Change Clock Frequency During Self-refresh Mode" mask="0x01000000" name="CHG_FRQ"/>
          <bitfield caption="Self-refresh is done (read-only)" mask="0x02000000" name="SELF_DONE"/>
        </register>
        <register caption="Memory Device Register" name="MPDDRC_MD" offset="0x20" rw="RW" size="4">
          <bitfield caption="Memory Device" mask="0x00000007" name="MD" values="MPDDRC_MD__MD"/>
          <bitfield caption="Data Bus Width" mask="0x00000010" name="DBW" values="MPDDRC_MD__DBW"/>
          <bitfield caption="Write Latency (read-only)" mask="0x00000040" name="WL" values="MPDDRC_MD__WL"/>
          <bitfield caption="Read Latency 3 Option Support (read-only)" mask="0x00000080" name="RL3" values="MPDDRC_MD__RL3"/>
          <bitfield caption="Manufacturer Identification (read-only)" mask="0x0000FF00" name="MANU_ID"/>
          <bitfield caption="Revision Identification (read-only)" mask="0x00FF0000" name="REV_ID"/>
          <bitfield caption="DRAM Architecture (read-only)" mask="0x03000000" name="TYPE" values="MPDDRC_MD__TYPE"/>
          <bitfield caption="Density of Memory (read-only)" mask="0x3C000000" name="DENSITY" values="MPDDRC_MD__DENSITY"/>
          <bitfield caption="Width of Memory (read-only)" mask="0xC0000000" name="IO_WIDTH" values="MPDDRC_MD__IO_WIDTH"/>
        </register>
