zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27WLSOM1.atdf
        <register caption="Secure PIO Set I/O Non-Secure Register" name="S_PIO_SIONR" offset="0x30" rw="W" size="4">
          <bitfield caption="Set I/O Non-Secure" mask="0x00000001" name="P0"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000002" name="P1"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000004" name="P2"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000008" name="P3"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000010" name="P4"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000020" name="P5"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000040" name="P6"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000080" name="P7"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000100" name="P8"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000200" name="P9"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000400" name="P10"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00000800" name="P11"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00001000" name="P12"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00002000" name="P13"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00004000" name="P14"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00008000" name="P15"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00010000" name="P16"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00020000" name="P17"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00040000" name="P18"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00080000" name="P19"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00100000" name="P20"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00200000" name="P21"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00400000" name="P22"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x00800000" name="P23"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x01000000" name="P24"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x02000000" name="P25"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x04000000" name="P26"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x08000000" name="P27"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x10000000" name="P28"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x20000000" name="P29"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x40000000" name="P30"/>
          <bitfield caption="Set I/O Non-Secure" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Secure PIO Set I/O Secure Register" name="S_PIO_SIOSR" offset="0x34" rw="W" size="4">
          <bitfield caption="Set I/O Secure" mask="0x00000001" name="P0"/>
          <bitfield caption="Set I/O Secure" mask="0x00000002" name="P1"/>
          <bitfield caption="Set I/O Secure" mask="0x00000004" name="P2"/>
          <bitfield caption="Set I/O Secure" mask="0x00000008" name="P3"/>
          <bitfield caption="Set I/O Secure" mask="0x00000010" name="P4"/>
          <bitfield caption="Set I/O Secure" mask="0x00000020" name="P5"/>
          <bitfield caption="Set I/O Secure" mask="0x00000040" name="P6"/>
          <bitfield caption="Set I/O Secure" mask="0x00000080" name="P7"/>
          <bitfield caption="Set I/O Secure" mask="0x00000100" name="P8"/>
          <bitfield caption="Set I/O Secure" mask="0x00000200" name="P9"/>
          <bitfield caption="Set I/O Secure" mask="0x00000400" name="P10"/>
          <bitfield caption="Set I/O Secure" mask="0x00000800" name="P11"/>
          <bitfield caption="Set I/O Secure" mask="0x00001000" name="P12"/>
          <bitfield caption="Set I/O Secure" mask="0x00002000" name="P13"/>
          <bitfield caption="Set I/O Secure" mask="0x00004000" name="P14"/>
          <bitfield caption="Set I/O Secure" mask="0x00008000" name="P15"/>
          <bitfield caption="Set I/O Secure" mask="0x00010000" name="P16"/>
          <bitfield caption="Set I/O Secure" mask="0x00020000" name="P17"/>
          <bitfield caption="Set I/O Secure" mask="0x00040000" name="P18"/>
          <bitfield caption="Set I/O Secure" mask="0x00080000" name="P19"/>
          <bitfield caption="Set I/O Secure" mask="0x00100000" name="P20"/>
          <bitfield caption="Set I/O Secure" mask="0x00200000" name="P21"/>
          <bitfield caption="Set I/O Secure" mask="0x00400000" name="P22"/>
          <bitfield caption="Set I/O Secure" mask="0x00800000" name="P23"/>
          <bitfield caption="Set I/O Secure" mask="0x01000000" name="P24"/>
          <bitfield caption="Set I/O Secure" mask="0x02000000" name="P25"/>
          <bitfield caption="Set I/O Secure" mask="0x04000000" name="P26"/>
          <bitfield caption="Set I/O Secure" mask="0x08000000" name="P27"/>
          <bitfield caption="Set I/O Secure" mask="0x10000000" name="P28"/>
          <bitfield caption="Set I/O Secure" mask="0x20000000" name="P29"/>
          <bitfield caption="Set I/O Secure" mask="0x40000000" name="P30"/>
          <bitfield caption="Set I/O Secure" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Secure PIO I/O Security Status Register" name="S_PIO_IOSSR" offset="0x38" rw="R" size="4">
          <bitfield caption="I/O Security Status" mask="0x00000001" name="P0" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000002" name="P1" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000004" name="P2" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000008" name="P3" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000010" name="P4" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000020" name="P5" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000040" name="P6" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000080" name="P7" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000100" name="P8" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000200" name="P9" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000400" name="P10" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00000800" name="P11" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00001000" name="P12" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00002000" name="P13" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00004000" name="P14" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00008000" name="P15" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00010000" name="P16" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00020000" name="P17" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00040000" name="P18" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00080000" name="P19" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00100000" name="P20" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00200000" name="P21" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00400000" name="P22" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x00800000" name="P23" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x01000000" name="P24" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x02000000" name="P25" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x04000000" name="P26" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x08000000" name="P27" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x10000000" name="P28" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x20000000" name="P29" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x40000000" name="P30" values="S_PIO_IOSSR0__PX"/>
          <bitfield caption="I/O Security Status" mask="0x80000000" name="P31" values="S_PIO_IOSSR0__PX"/>
        </register>
        <register caption="Secure PIO I/O Freeze Configuration Register" name="S_PIO_IOFR" offset="0x3C" rw="W" size="4">
          <bitfield caption="Freeze Physical Configuration" mask="0x00000001" name="FPHY"/>
          <bitfield caption="Freeze Interrupt Configuration" mask="0x00000002" name="FINT"/>
          <bitfield caption="Freeze Key" mask="0xFFFFFF00" name="FRZKEY" values="S_PIO_IOFR__FRZKEY"/>
        </register>
      </register-group>
      <register-group name="PIO">
        <register-group name="PIO_GROUP" size="64" name-in-module="PIO_GROUP" offset="0x0" count="4"/>
        <register caption="PIO Write Protection Mode Register" name="PIO_WPMR" offset="0x5E0" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PIO_WPMR__WPKEY"/>
        </register>
        <register caption="PIO Write Protection Status Register" name="PIO_WPSR" offset="0x5E4" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register-group name="PIO_SGROUP" size="64" name-in-module="PIO_SGROUP" offset="0x1000" count="4"/>
