zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27WLSOM1.atdf
      <value-group caption="Data Width" name="SDMMC_HC1R__DW">
        <value caption="1-bit mode." name="_1_BIT" value="0"/>
        <value caption="4-bit mode." name="_4_BIT" value="1"/>
      </value-group>
      <value-group caption="DMA Select" name="SDMMC_HC1R__DMASEL">
        <value caption="SDMA is selected" name="SDMA" value="0x0"/>
        <value caption="32-bit Address ADMA2 is selected" name="ADMA32" value="0x2"/>
      </value-group>
      <value-group caption="Data Width" name="SDMMC_HC1R_E_MMC__DW">
        <value caption="1-bit mode." name="_1_BIT" value="0"/>
        <value caption="4-bit mode." name="_4_BIT" value="1"/>
      </value-group>
      <value-group caption="DMA Select" name="SDMMC_HC1R_E_MMC__DMASEL">
        <value caption="SDMA is selected" name="SDMA" value="0x0"/>
        <value caption="32-bit Address ADMA2 is selected" name="ADMA32" value="0x2"/>
      </value-group>
      <value-group caption="Interrupt at Block Gap" name="SDMMC_BGCR__INTBG">
        <value caption="Interrupt detection disabled." name="DISABLED" value="0"/>
        <value caption="Interrupt detection enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Wakeup Event Enable on Card Interrupt" name="SDMMC_WCR__WKENCINT">
        <value caption="Wakeup Event disabled." name="DISABLED" value="0"/>
        <value caption="Wakeup Event enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Wakeup Event Enable on Card Insertion" name="SDMMC_WCR__WKENCINS">
        <value caption="Wakeup Event disabled." name="DISABLED" value="0"/>
        <value caption="Wakeup Event enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Wakeup Event Enable on Card Removal" name="SDMMC_WCR__WKENCREM">
        <value caption="Wakeup Event disabled." name="DISABLED" value="0"/>
        <value caption="Wakeup Event enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Complete Status Enable" name="SDMMC_NISTER__CMDC">
        <value caption="The CMDC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Transfer Complete Status Enable" name="SDMMC_NISTER__TRFC">
        <value caption="The TRFC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The TRFC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Block Gap Event Status Enable" name="SDMMC_NISTER__BLKGE">
        <value caption="The BLKGE status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BLKGE status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DMA Interrupt Status Enable" name="SDMMC_NISTER__DMAINT">
        <value caption="The DMAINT status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The DMAINT status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Write Ready Status Enable" name="SDMMC_NISTER__BWRRDY">
        <value caption="The BWRRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BWRRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Read Ready Status Enable" name="SDMMC_NISTER__BRDRDY">
        <value caption="The BRDRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BRDRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Insertion Status Enable" name="SDMMC_NISTER__CINS">
        <value caption="The CINS status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CINS status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Removal Status Enable" name="SDMMC_NISTER__CREM">
        <value caption="The CREM status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CREM status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Card Interrupt Status Enable" name="SDMMC_NISTER__CINT">
        <value caption="The CINT status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CINT status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Complete Status Enable" name="SDMMC_NISTER_E_MMC__CMDC">
        <value caption="The CMDC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Transfer Complete Status Enable" name="SDMMC_NISTER_E_MMC__TRFC">
        <value caption="The TRFC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The TRFC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Block Gap Event Status Enable" name="SDMMC_NISTER_E_MMC__BLKGE">
        <value caption="The BLKGE status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BLKGE status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="DMA Interrupt Status Enable" name="SDMMC_NISTER_E_MMC__DMAINT">
        <value caption="The DMAINT status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The DMAINT status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Write Ready Status Enable" name="SDMMC_NISTER_E_MMC__BWRRDY">
        <value caption="The BWRRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BWRRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Buffer Read Ready Status Enable" name="SDMMC_NISTER_E_MMC__BRDRDY">
        <value caption="The BRDRDY status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BRDRDY status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Boot Acknowledge Received Status Enable" name="SDMMC_NISTER_E_MMC__BOOTAR">
        <value caption="The BOOTAR status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The BOOTAR status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Timeout Error Status Enable" name="SDMMC_EISTER__CMDTEO">
        <value caption="The CMDTEO status flag in SDMMC_EISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDTEO status flag in SDMMC_EISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
