zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27WLSOM1.atdf
        <register caption="UDPHS Endpoint Clear Status Register (endpoint = 0)" name="UDPHS_EPTCLRSTA" offset="0x18" rw="W" size="4">
          <mode name="DEFAULT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x0 0x2 0x3"/>
          <mode name="ISOENDPT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x1"/>
          <bitfield caption="Stall Handshake Request Clear" mask="0x00000020" modes="DEFAULT" name="FRCESTALL"/>
          <bitfield caption="Data Toggle Clear" mask="0x00000040" modes="DEFAULT" name="TOGGLESQ"/>
          <bitfield caption="Received OUT Data Clear" mask="0x00000200" modes="DEFAULT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Clear" mask="0x00000400" modes="DEFAULT" name="TX_COMPLT"/>
          <bitfield caption="Received SETUP Clear" mask="0x00001000" modes="DEFAULT" name="RX_SETUP"/>
          <bitfield caption="Stall Sent Clear" mask="0x00002000" modes="DEFAULT" name="STALL_SNT"/>
          <bitfield caption="NAKIN Clear" mask="0x00004000" modes="DEFAULT" name="NAK_IN"/>
          <bitfield caption="NAKOUT Clear" mask="0x00008000" modes="DEFAULT" name="NAK_OUT"/>
          <bitfield caption="Data Toggle Clear" mask="0x00000040" modes="ISOENDPT" name="TOGGLESQ"/>
          <bitfield caption="Received OUT Data Clear" mask="0x00000200" modes="ISOENDPT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete Clear" mask="0x00000400" modes="ISOENDPT" name="TX_COMPLT"/>
          <bitfield caption="Error Flow Clear" mask="0x00001000" modes="ISOENDPT" name="ERR_FL_ISO"/>
          <bitfield caption="Number of Transaction Error Clear" mask="0x00002000" modes="ISOENDPT" name="ERR_CRC_NTR"/>
          <bitfield caption="Bank Flush Error Clear" mask="0x00004000" modes="ISOENDPT" name="ERR_FLUSH"/>
        </register>
        <register caption="UDPHS Endpoint Status Register (endpoint = 0)" name="UDPHS_EPTSTA" offset="0x1C" rw="R" size="4">
          <mode name="DEFAULT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x0 0x2 0x3"/>
          <mode name="ISOENDPT" qualifier="UDPHS_EPT.EPT_TYPE" value="0x1"/>
          <bitfield caption="Stall Handshake Request (cleared upon USB reset)" mask="0x00000020" modes="DEFAULT" name="FRCESTALL"/>
          <bitfield caption="Toggle Sequencing (cleared upon USB reset)" mask="0x000000C0" modes="DEFAULT" name="TOGGLESQ_STA" values="UDPHS_EPTSTA0__TOGGLESQ_STA"/>
          <bitfield caption="Overflow Error (cleared upon USB reset)" mask="0x00000100" modes="DEFAULT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data/KILL Bank (cleared upon USB reset)" mask="0x00000200" modes="DEFAULT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete (cleared upon USB reset)" mask="0x00000400" modes="DEFAULT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready (cleared upon USB reset)" mask="0x00000800" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Received SETUP (cleared upon USB reset)" mask="0x00001000" modes="DEFAULT" name="RX_SETUP"/>
          <bitfield caption="Stall Sent (cleared upon USB reset)" mask="0x00002000" modes="DEFAULT" name="STALL_SNT"/>
          <bitfield caption="NAK IN (cleared upon USB reset)" mask="0x00004000" modes="DEFAULT" name="NAK_IN"/>
          <bitfield caption="NAK OUT (cleared upon USB reset)" mask="0x00008000" modes="DEFAULT" name="NAK_OUT"/>
          <bitfield caption="Current Bank/Control Direction (cleared upon USB reset)" mask="0x00030000" modes="DEFAULT" name="CURBK_CTLDIR"/>
          <bitfield caption="Busy Bank Number (cleared upon USB reset)" mask="0x000C0000" modes="DEFAULT" name="BUSY_BANK_STA" values="UDPHS_EPTSTA0__BUSY_BANK_STA"/>
          <bitfield caption="UDPHS Byte Count (cleared upon USB reset)" mask="0x7FF00000" modes="DEFAULT" name="BYTE_COUNT"/>
          <bitfield caption="Short Packet (cleared upon USB reset)" mask="0x80000000" modes="DEFAULT" name="SHRT_PCKT"/>
          <bitfield caption="Toggle Sequencing (cleared upon USB reset)" mask="0x000000C0" modes="ISOENDPT" name="TOGGLESQ_STA" values="UDPHS_EPTSTA0_ISOENDPT__TOGGLESQ_STA"/>
          <bitfield caption="Overflow Error (cleared upon USB reset)" mask="0x00000100" modes="ISOENDPT" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data/KILL Bank (cleared upon USB reset)" mask="0x00000200" modes="ISOENDPT" name="RXRDY_TXKL"/>
          <bitfield caption="Transmitted IN Data Complete (cleared upon USB reset)" mask="0x00000400" modes="ISOENDPT" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error (cleared upon USB reset)" mask="0x00000800" modes="ISOENDPT" name="TXRDY_TRER"/>
          <bitfield caption="Error Flow (cleared upon USB reset)" mask="0x00001000" modes="ISOENDPT" name="ERR_FL_ISO"/>
          <bitfield caption="CRC ISO Error/Number of Transaction Error (cleared upon USB reset)" mask="0x00002000" modes="ISOENDPT" name="ERR_CRC_NTR"/>
          <bitfield caption="Bank Flush Error (cleared upon USB reset)" mask="0x00004000" modes="ISOENDPT" name="ERR_FLUSH"/>
          <bitfield caption="Current Bank (cleared upon USB reset)" mask="0x00030000" modes="ISOENDPT" name="CURBK" values="UDPHS_EPTSTA0_ISOENDPT__CURBK"/>
          <bitfield caption="Busy Bank Number (cleared upon USB reset)" mask="0x000C0000" modes="ISOENDPT" name="BUSY_BANK_STA" values="UDPHS_EPTSTA0_ISOENDPT__BUSY_BANK_STA"/>
          <bitfield caption="UDPHS Byte Count (cleared upon USB reset)" mask="0x7FF00000" modes="ISOENDPT" name="BYTE_COUNT"/>
          <bitfield caption="Short Packet (cleared upon USB reset)" mask="0x80000000" modes="ISOENDPT" name="SHRT_PCKT"/>
        </register>
      </register-group>
      <register-group name="UDPHS">
        <register caption="UDPHS Control Register" name="UDPHS_CTRL" offset="0x00" rw="RW" size="4">
          <bitfield caption="UDPHS Address (cleared upon USB reset)" mask="0x0000007F" name="DEV_ADDR"/>
          <bitfield caption="Function Address Enable (cleared upon USB reset)" mask="0x00000080" name="FADDR_EN"/>
          <bitfield caption="UDPHS Enable" mask="0x00000100" name="EN_UDPHS"/>
          <bitfield caption="Detach Command" mask="0x00000200" name="DETACH"/>
          <bitfield caption="Send Remote Wakeup (cleared upon USB reset)" mask="0x00000400" name="REWAKEUP"/>
          <bitfield caption="Pulldown Disable (cleared upon USB reset)" mask="0x00000800" name="PULLD_DIS"/>
        </register>
        <register caption="UDPHS Frame Number Register" name="UDPHS_FNUM" offset="0x04" rw="R" size="4">
          <bitfield caption="Microframe Number (cleared upon USB reset)" mask="0x00000007" name="MICRO_FRAME_NUM"/>
          <bitfield caption="Frame Number as defined in the Packet Field Formats (cleared upon USB reset)" mask="0x00003FF8" name="FRAME_NUMBER"/>
          <bitfield caption="Frame Number CRC Error (cleared upon USB reset)" mask="0x80000000" name="FNUM_ERR"/>
        </register>
