zephyrproject-rtos/hal_microchip/packs/sam/sama5d2/sama5d27som/atdf/ATSAMA5D27WLSOM1.atdf
    <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
  </modules>
  <pinouts>
    <pinout name="TFBGA361">
      <pin position="W11" pad="PA0"/>
      <pin position="R9" pad="PA1"/>
      <pin position="W12" pad="PA2"/>
      <pin position="V11" pad="PA3"/>
      <pin position="W14" pad="PA4"/>
      <pin position="V10" pad="PA5"/>
      <pin position="W15" pad="PA6"/>
      <pin position="W16" pad="PA7"/>
      <pin position="V12" pad="PA8"/>
      <pin position="V16" pad="PA9"/>
      <pin position="V14" pad="PA10"/>
      <pin position="L18" pad="PA11"/>
      <pin position="T16" pad="PA12"/>
      <pin position="K18" pad="PA13"/>
      <pin position="R19" pad="PA14"/>
      <pin position="L17" pad="PA15"/>
      <pin position="N19" pad="PA16"/>
      <pin position="M16" pad="PA17"/>
      <pin position="V19" pad="PA18"/>
      <pin position="V15" pad="PA19"/>
      <pin position="T10" pad="PA20"/>
      <pin position="U19" pad="PA21"/>
      <pin position="V17" pad="PA22"/>
      <pin position="U18" pad="PA23"/>
      <pin position="W17" pad="PA24"/>
      <pin position="W18" pad="PA25"/>
      <pin position="U14" pad="PA26"/>
      <pin position="M18" pad="PA27"/>
      <pin position="U13" pad="PA28"/>
      <pin position="U16" pad="PA29"/>
      <pin position="U12" pad="PA30"/>
      <pin position="U17" pad="PA31"/>
      <pin position="C7" pad="PB0"/>
      <pin position="A9" pad="PB1"/>
      <pin position="A10" pad="PB2"/>
      <pin position="A11" pad="PB3"/>
      <pin position="A12" pad="PB4"/>
      <pin position="A7" pad="PB5"/>
      <pin position="B7" pad="PB6"/>
      <pin position="C5" pad="PB7"/>
      <pin position="B8" pad="PB8"/>
      <pin position="B6" pad="PB9"/>
      <pin position="G6" pad="PB10"/>
      <pin position="B5" pad="PB11"/>
      <pin position="A6" pad="PB12"/>
      <pin position="C4" pad="PB13"/>
      <pin position="G4" pad="PB14"/>
      <pin position="H4" pad="PB15"/>
      <pin position="A4" pad="PB16"/>
      <pin position="B3" pad="PB17"/>
      <pin position="D3" pad="PB18"/>
      <pin position="F4" pad="PB19"/>
      <pin position="F2" pad="PB20"/>
      <pin position="F3" pad="PB21"/>
      <pin position="E4" pad="PB22"/>
      <pin position="H2" pad="PB23"/>
      <pin position="A3" pad="PB24"/>
      <pin position="H1" pad="PB25"/>
      <pin position="G2" pad="PB26"/>
      <pin position="H5" pad="PB27"/>
      <pin position="J2" pad="PB28"/>
      <pin position="J3" pad="PB29"/>
      <pin position="A2" pad="PB30"/>
      <pin position="J4" pad="PB31"/>
      <pin position="T14" pad="PC0"/>
      <pin position="R16" pad="PC1"/>
      <pin position="T15" pad="PC2"/>
      <pin position="T13" pad="PC3"/>
      <pin position="P16" pad="PC4"/>
      <pin position="L19" pad="PC5"/>
      <pin position="R15" pad="PC6"/>
      <pin position="N15" pad="PC7"/>
      <pin position="P11" pad="PC8"/>
      <pin position="B2" pad="PC9"/>
      <pin position="K5" pad="PC10"/>
      <pin position="C2" pad="PC11"/>
      <pin position="D2" pad="PC12"/>
      <pin position="K2" pad="PC13"/>
      <pin position="K6" pad="PC14"/>
      <pin position="B1" pad="PC15"/>
      <pin position="K9" pad="PC16"/>
      <pin position="C1" pad="PC17"/>
      <pin position="L9" pad="PC18"/>
      <pin position="D1" pad="PC19"/>
      <pin position="L8" pad="PC20"/>
      <pin position="E3" pad="PC21"/>
      <pin position="E2" pad="PC22"/>
      <pin position="L7" pad="PC23"/>
      <pin position="E1" pad="PC24"/>
      <pin position="L4" pad="PC25"/>
      <pin position="D6" pad="PC26"/>
      <pin position="E7" pad="PC27"/>
      <pin position="J5" pad="PC28"/>
      <pin position="C6" pad="PC29"/>
      <pin position="D7" pad="PC30"/>
      <pin position="C8" pad="PC31"/>
      <pin position="J7" pad="PD0"/>
      <pin position="D8" pad="PD1"/>
      <pin position="J6" pad="PD2"/>
      <pin position="M3" pad="PD3"/>
      <pin position="L6" pad="PD4"/>
      <pin position="L2" pad="PD5"/>
      <pin position="J1" pad="PD6"/>
      <pin position="L5" pad="PD7"/>
      <pin position="K1" pad="PD8"/>
      <pin position="L3" pad="PD9"/>
      <pin position="L1" pad="PD10"/>
      <pin position="N3" pad="PD11"/>
      <pin position="M7" pad="PD12"/>
      <pin position="N2" pad="PD13"/>
      <pin position="M6" pad="PD14"/>
      <pin position="M5" pad="PD15"/>
      <pin position="M1" pad="PD16"/>
      <pin position="M2" pad="PD17"/>
      <pin position="M4" pad="PD18"/>
      <pin position="M8" pad="PD19"/>
      <pin position="N1" pad="PD20"/>
      <pin position="P3" pad="PD21"/>
      <pin position="N6" pad="PD22"/>
      <pin position="P1" pad="PD23"/>
      <pin position="N8" pad="PD24"/>
      <pin position="P8" pad="PD25"/>
      <pin position="P2" pad="PD26"/>
      <pin position="N5" pad="PD27"/>
      <pin position="N4" pad="PD28"/>
      <pin position="R2" pad="PD29"/>
      <pin position="N10" pad="PD30"/>
      <pin position="P7" pad="PD31"/>
      <pin position="M9" pad="ADVREF"/>
      <pin position="G1" pad="VDDANA"/>
      <pin position="H6" pad="VDDANA"/>
      <pin position="F1" pad="GNDANA"/>
      <pin position="G5" pad="GNDANA"/>
      <pin position="M12" pad="DDR_VREF"/>
      <pin position="J10" pad="DDR_VREF"/>
      <pin position="C19" pad="ZQ"/>
      <pin position="E11" pad="VDDIODDR"/>
      <pin position="E8" pad="VDDIODDR"/>
      <pin position="H10" pad="VDDIODDR"/>
      <pin position="J13" pad="VDDIODDR"/>
      <pin position="J8" pad="VDDIODDR"/>
      <pin position="L10" pad="VDDIODDR"/>
      <pin position="P12" pad="VDDIODDR"/>
      <pin position="E10" pad="GNDIODDR"/>
      <pin position="F8" pad="GNDIODDR"/>
      <pin position="G10" pad="GNDIODDR"/>
      <pin position="J9" pad="GNDIODDR"/>
      <pin position="L11" pad="GNDIODDR"/>
      <pin position="M13" pad="GNDIODDR"/>
      <pin position="N12" pad="GNDIODDR"/>
      <pin position="C3" pad="VDDCORE"/>
      <pin position="C9" pad="VDDCORE"/>
      <pin position="K3" pad="VDDCORE"/>
      <pin position="U9" pad="VDDCORE"/>
      <pin position="V5" pad="VDDCORE"/>
      <pin position="W6" pad="VDDCORE"/>
      <pin position="K8" pad="VDDCORE"/>
      <pin position="A1" pad="GNDCORE"/>
      <pin position="D9" pad="GNDCORE"/>
      <pin position="J11" pad="GNDCORE"/>
      <pin position="K4" pad="GNDCORE"/>
      <pin position="K7" pad="GNDCORE"/>
      <pin position="V9" pad="GNDCORE"/>
      <pin position="W1" pad="GNDCORE"/>
      <pin position="B4" pad="VDDIOP0"/>
      <pin position="D5" pad="VDDIOP1"/>
      <pin position="A5" pad="GNDIOP0"/>
      <pin position="D4" pad="GNDIOP0"/>
      <pin position="V13" pad="VDDIOP1"/>
      <pin position="V18" pad="VDDIOP1"/>
      <pin position="P13" pad="GNDIOP1"/>
      <pin position="R13" pad="GNDIOP2"/>
      <pin position="W13" pad="GNDIOP3"/>
      <pin position="W19" pad="GNDIOP4"/>
      <pin position="A8" pad="VDDIOP2"/>
      <pin position="B9" pad="GNDIOP2"/>
      <pin position="T7" pad="VDDSDMMC"/>
      <pin position="T8" pad="GNDSDMMC"/>
      <pin position="G3" pad="VDDISC"/>
      <pin position="H3" pad="GNDISC"/>
      <pin position="U15" pad="VDDFUSE"/>
      <pin position="P9" pad="VDDPLLA"/>
      <pin position="P10" pad="GNDPLLA"/>
      <pin position="R6" pad="VDDAUDIOPLL"/>
      <pin position="N9" pad="GNDDPLL"/>
      <pin position="P6" pad="GNDAUDIOPLL"/>
      <pin position="W2" pad="CLK_AUDIO"/>
      <pin position="W5" pad="XIN"/>
      <pin position="W4" pad="XOUT"/>
      <pin position="R10" pad="VDDOSC"/>
      <pin position="T11" pad="GNDOSC"/>
      <pin position="R8" pad="VDDUTMII"/>
      <pin position="U7" pad="VDDHSIC"/>
      <pin position="R7" pad="GNDUTMII"/>
      <pin position="W7" pad="HHSDPA"/>
      <pin position="V7" pad="HHSDMA"/>
      <pin position="W8" pad="HHSDPB"/>
      <pin position="V8" pad="HHSDMB"/>
      <pin position="W9" pad="HHSDPDATC"/>
      <pin position="W10" pad="HHSDMSTRC"/>
      <pin position="T6" pad="VDDUTMIC"/>
      <pin position="U6" pad="GNDUTMIC"/>
      <pin position="V6" pad="VBG"/>
      <pin position="T2" pad="TST"/>
      <pin position="W3" pad="NRST"/>
      <pin position="T3" pad="JTAGSEL"/>
      <pin position="U2" pad="WKUP"/>
      <pin position="R1" pad="RXD"/>
      <pin position="P4" pad="SHDN"/>
      <pin position="R4" pad="PIOBU0"/>
      <pin position="R5" pad="PIOBU1"/>
      <pin position="R3" pad="PIOBU2"/>
      <pin position="T4" pad="PIOBU3"/>
      <pin position="U3" pad="PIOBU4"/>
      <pin position="T5" pad="PIOBU5"/>
      <pin position="U5" pad="PIOBU6"/>
      <pin position="P5" pad="PIOBU7"/>
      <pin position="V3" pad="VDDBU"/>
      <pin position="U4" pad="GNDBU"/>
      <pin position="U1" pad="XIN32"/>
      <pin position="T1" pad="XOUT32"/>
      <pin position="V1" pad="COMPP"/>
      <pin position="V2" pad="COMPN"/>
      <pin position="A14" pad="DDRM_VSS"/>
      <pin position="A19" pad="DDRM_VSS"/>
      <pin position="B14" pad="DDRM_VSS"/>
      <pin position="B18" pad="DDRM_VSS"/>
      <pin position="C14" pad="DDRM_VSS"/>
      <pin position="C18" pad="DDRM_VSS"/>
      <pin position="D14" pad="DDRM_VSS"/>
      <pin position="D18" pad="DDRM_VSS"/>
      <pin position="E14" pad="DDRM_VSS"/>
      <pin position="E18" pad="DDRM_VSS"/>
      <pin position="F14" pad="DDRM_VSS"/>
      <pin position="F18" pad="DDRM_VSS"/>
      <pin position="G14" pad="DDRM_VSS"/>
      <pin position="G18" pad="DDRM_VSS"/>
      <pin position="H14" pad="DDRM_VSS"/>
      <pin position="H18" pad="DDRM_VSS"/>
      <pin position="N14" pad="DDRM_VSS"/>
      <pin position="N17" pad="DDRM_VSS"/>
      <pin position="N18" pad="DDRM_VSS"/>
      <pin position="P14" pad="DDRM_VSS"/>
      <pin position="P18" pad="DDRM_VSS"/>
      <pin position="R14" pad="DDRM_VSS"/>
      <pin position="R18" pad="DDRM_VSS"/>
      <pin position="T18" pad="DDRM_VSS"/>
      <pin position="B15" pad="DDRM_VDD12"/>
      <pin position="B17" pad="DDRM_VDD13"/>
      <pin position="B19" pad="DDRM_VDD14"/>
      <pin position="D15" pad="DDRM_VDD15"/>
      <pin position="D17" pad="DDRM_VDD16"/>
      <pin position="D19" pad="DDRM_VDD17"/>
      <pin position="F15" pad="DDRM_VDD18"/>
      <pin position="F17" pad="DDRM_VDD19"/>
      <pin position="F19" pad="DDRM_VDD20"/>
      <pin position="H15" pad="DDRM_VDD21"/>
      <pin position="H17" pad="DDRM_VDD22"/>
      <pin position="H19" pad="DDRM_VDD23"/>
      <pin position="K15" pad="DDRM_VDD24"/>
      <pin position="K17" pad="DDRM_VDD25"/>
      <pin position="K19" pad="DDRM_VDD26"/>
      <pin position="M15" pad="DDRM_VDD27"/>
      <pin position="M17" pad="DDRM_VDD28"/>
      <pin position="M19" pad="DDRM_VDD29"/>
      <pin position="P15" pad="DDRM_VDD30"/>
      <pin position="P17" pad="DDRM_VDD31"/>
      <pin position="P19" pad="DDRM_VDD32"/>
      <pin position="T17" pad="DDRM_VDD33"/>
      <pin position="T19" pad="DDRM_VDD34"/>
      <pin position="B11" pad="DDRM_VDD18"/>
      <pin position="B13" pad="DDRM_VDD19"/>
      <pin position="D11" pad="DDRM_VDD20"/>
      <pin position="D13" pad="DDRM_VDD21"/>
      <pin position="K13" pad="DDRM_VDD22"/>
      <pin position="K16" pad="DDRM_VDD23"/>
      <pin position="A13" pad="NC"/>
      <pin position="A15" pad="NC"/>
      <pin position="A16" pad="NC"/>
      <pin position="A17" pad="NC"/>
      <pin position="A18" pad="NC"/>
      <pin position="B10" pad="NC"/>
      <pin position="B12" pad="NC"/>
      <pin position="B16" pad="NC"/>
      <pin position="C10" pad="NC"/>
      <pin position="C11" pad="NC"/>
      <pin position="C12" pad="NC"/>
      <pin position="C13" pad="NC"/>
      <pin position="C15" pad="NC"/>
      <pin position="C16" pad="NC"/>
      <pin position="C17" pad="NC"/>
      <pin position="D10" pad="NC"/>
      <pin position="D12" pad="NC"/>
      <pin position="D16" pad="NC"/>
      <pin position="E12" pad="NC"/>
      <pin position="E13" pad="NC"/>
      <pin position="E15" pad="NC"/>
      <pin position="E16" pad="NC"/>
      <pin position="E17" pad="NC"/>
      <pin position="E19" pad="NC"/>
      <pin position="E5" pad="NC"/>
      <pin position="E6" pad="NC"/>
      <pin position="E9" pad="NC"/>
      <pin position="F10" pad="NC"/>
      <pin position="F11" pad="NC"/>
      <pin position="F12" pad="NC"/>
      <pin position="F13" pad="NC"/>
      <pin position="F16" pad="NC"/>
      <pin position="F5" pad="NC"/>
      <pin position="F6" pad="NC"/>
      <pin position="F7" pad="NC"/>
      <pin position="F9" pad="NC"/>
      <pin position="G11" pad="NC"/>
      <pin position="G12" pad="NC"/>
      <pin position="G13" pad="NC"/>
      <pin position="G15" pad="NC"/>
      <pin position="G16" pad="NC"/>
      <pin position="G17" pad="NC"/>
      <pin position="G19" pad="NC"/>
      <pin position="G7" pad="NC"/>
      <pin position="G8" pad="NC"/>
      <pin position="G9" pad="NC"/>
      <pin position="H11" pad="NC"/>
      <pin position="H12" pad="NC"/>
      <pin position="H13" pad="NC"/>
      <pin position="H16" pad="NC"/>
      <pin position="H7" pad="NC"/>
      <pin position="H8" pad="NC"/>
      <pin position="H9" pad="NC"/>
      <pin position="J12" pad="NC"/>
      <pin position="J14" pad="NC"/>
      <pin position="J15" pad="NC"/>
      <pin position="J16" pad="NC"/>
      <pin position="J17" pad="NC"/>
      <pin position="J18" pad="NC"/>
      <pin position="J19" pad="NC"/>
      <pin position="K10" pad="NC"/>
      <pin position="K11" pad="NC"/>
      <pin position="K12" pad="NC"/>
      <pin position="K14" pad="NC"/>
      <pin position="L12" pad="NC"/>
      <pin position="L13" pad="NC"/>
      <pin position="L14" pad="NC"/>
      <pin position="L15" pad="NC"/>
      <pin position="L16" pad="NC"/>
      <pin position="M10" pad="NC"/>
      <pin position="M11" pad="NC"/>
      <pin position="M14" pad="NC"/>
      <pin position="N11" pad="NC"/>
      <pin position="N13" pad="NC"/>
      <pin position="N16" pad="NC"/>
      <pin position="N7" pad="NC"/>
      <pin position="R11" pad="NC"/>
      <pin position="R12" pad="NC"/>
      <pin position="R17" pad="NC"/>
      <pin position="T12" pad="NC"/>
      <pin position="T9" pad="NC"/>
      <pin position="U10" pad="NC"/>
      <pin position="U11" pad="NC"/>
      <pin position="U8" pad="NC"/>
      <pin position="V4" pad="NC"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
